"""параметры топлив. Все значения взяты из лекций Куникеева"""

# Варианты названия топлив, везде в расчетах использовать ТОЛЬКО эти константы!
# хардкодить названия топлив нельзя
KEROSENE_FUEL = 'керосин'
DIESEL_FUEL = 'дизельное топливо'
SOLAR_OIL = 'соляровое масло'
MAZUT_FUEL = 'мазут Ф12'
NATURAL_GAS_FUEL = 'природный газ'
COKE_OVEN_GAS_FUEL = 'коксовый газ'
BIOGAS_FUEL = 'биогаз'

AIR = 'воздух сухой'

# Коэффициенты полинома для расчета C_pi
c_pi_coef: dict[str, list[float]] = {
    AIR: [
        1.084192000,
        -0.684074000,
        1.859839000,
        -1.810400000,
        0.890290000,
        -0.221403000,
        0.022161000,
    ],
    KEROSENE_FUEL: [
        1.036867692,
        -0.105966235,
        0.811522074,
        -0.688234126,
        0.241363138,
        -0.031481141,
    ],
    DIESEL_FUEL: [
        1.029211903,
        -0.095175436,
        0.795973888,
        -0.679454086,
        0.238871513,
        -0.031173571,
    ],
    SOLAR_OIL: [
        1.026085190,
        -0.091902717,
        0.789661482,
        -0.674743383,
        0.236921457,
        -0.030820658,
    ],
    MAZUT_FUEL: [
        1.021419099,
        -0.082335508,
        0.776148196,
        -0.666407013,
        0.234418421,
        -0.030526419,
    ],
    NATURAL_GAS_FUEL: [
        1.099806221,
        -0.208964431,
        0.959060465,
        -0.773425872,
        0.265022712,
        -0.034093836,
    ],
    COKE_OVEN_GAS_FUEL: [
        1.139046990,
        -0.253191131,
        1.013762164,
        -0.788320034,
        0.261164452,
        -0.032275240,
    ],
    BIOGAS_FUEL: [
        1.040081554,
        -0.029358925,
        0.724371574,
        -0.624213758,
        0.218036431,
        -0.028242494,
    ],
}

# Стехиометрическое количество сухогоо воздуха
l_0: dict[str: float] = {
    KEROSENE_FUEL: 14.815,
    DIESEL_FUEL: 14.49,
    SOLAR_OIL: 14.35,
    MAZUT_FUEL: 14.01,
    NATURAL_GAS_FUEL: 16.683,
    COKE_OVEN_GAS_FUEL: 10.287,
    BIOGAS_FUEL: 6.078,
}

# Низшая теплота сгорания при 0°С, кДж/кг
Q_n: dict[str: int] = {
    KEROSENE_FUEL: 43_970,
    DIESEL_FUEL: 42_980,
    SOLAR_OIL: 42_565,
    MAZUT_FUEL: 41_515,
    NATURAL_GAS_FUEL: 49_208,
    COKE_OVEN_GAS_FUEL: 33_103,
    BIOGAS_FUEL: 17_926,
}

# Газовая постоянная продуктов сгорания при α=1, Дж/(кг К)
R_g1: dict[str: float] = {
    KEROSENE_FUEL: 288.9,
    DIESEL_FUEL: 287.4,
    SOLAR_OIL: 286.8,
    MAZUT_FUEL: 285.9,
    NATURAL_GAS_FUEL: 302.18,
    COKE_OVEN_GAS_FUEL: 308.48,
    BIOGAS_FUEL: 292.08,
}

# Коэффициенты полинома для расчета R_g
R_g_coef: dict[str, list[float]] = {
    KEROSENE_FUEL: [288.20, 0.69],
    DIESEL_FUEL: [288.18, -0.81],
    SOLAR_OIL: [288.17, -1.43],
    MAZUT_FUEL: [288.16, -2.25],
    NATURAL_GAS_FUEL: [290.03, 12.21],
    COKE_OVEN_GAS_FUEL: [288.49, 20.15],
    BIOGAS_FUEL: [289.97, 2.14],
}
